import web from "../src/images/html-css.jpg";
import js from "../src/images/js.jpg";
import python from "../src/images/python.jpg";
import php from "../src/images/Php.png";
import cplus from "../src/images/c++.jpg";
import csharp from "../src/images/csharp-min_buiizq.png";
import git from "../src/images/git.png";
import java from "../src/images/java.jpg";
import npm from "../src/images/npm.png";
import sql from "../src/images/SQL.jpg";
import ui_ux from "../src/images/ui-ux.jpg";
import bootstrap from "../src/images/bootstrap.png"


const Sdata = [
    {
        bottom: "/htcs",
        imgsrc: web,
        title: "HTML CSS",
        p: "HTML (HyperText Markup Language, язык разметки гипертекста) задаёт структуру содержимого и его смысл, определяя такой контент как, к примеру, заголовки, абзацы или изображения. CSS (Cascading Style Sheets) или каскадные таблицы стилей — это язык презентаций созданный для оформления внешнего вида контента, использующий, например, шрифты или цвета."
    },
    {
        bottom: "/javascript",
        imgsrc: js,
        title: "JavaScript",
        p: "JavaScript — мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений."
    },
    {
        bottom: "/python",
        imgsrc: python,
        title: "Python",
        p: "Python — высокоуровневый язык программирования общего назначения с динамической строгой типизацией и автоматическим управлением памятью, ориентированный на повышение производительности разработчика, читаемости кода и его качества, а также на обеспечение переносимости написанных на нём программ."
    },
    {
        bottom: "/php",
        imgsrc: php,
        title: "Php",
        p: "PHP — скриптовый язык общего назначения, интенсивно применяемый для разработки веб-приложений. В настоящее время поддерживается подавляющим большинством хостинг-провайдеров и является одним из лидеров среди языков, применяющихся для создания динамических веб-сайтов"
    },
    {
        bottom: "/bootstrap",
        imgsrc: bootstrap,
        title: "bootstrap",
        p: "Bootstrap — свободный набор инструментов для создания сайтов и веб-приложений. Включает в себя HTML- и CSS-шаблоны оформления для типографики, веб-форм, кнопок, меток, блоков навигации и прочих компонентов веб-интерфейса, включая JavaScript-расширения"
    },
    {
        bottom: "/cplus",
        imgsrc: cplus,
        title: "C++",
        p: "C++ — компилируемый, статически типизированный язык программирования общего назначения. Поддерживает такие парадигмы программирования, как процедурное программирование, объектно-ориентированное программирование, обобщённое программирование."
    },
    {
        bottom: "/csharp",
        imgsrc: csharp,
        title: "C#",
        p: "C# — объектно-ориентированный язык программирования. Разработан в 1998—2001 годах группой инженеров компании Microsoft под руководством Андерса Хейлсберга и Скотта Вильтаумота как язык разработки приложений для платформы Microsoft .NET Framework. Впоследствии был стандартизирован как ECMA-334 и ISO/IEC 23270."
    },
    {
        bottom: "/git",
        imgsrc: git,
        title: "Git",
        p: "Git — распределённая система управления версиями. Проект был создан Линусом Торвальдсом для управления разработкой ядра Linux, первая версия выпущена 7 апреля 2005 года. На сегодняшний день его поддерживает Джунио Хамано."
    },
    {
        bottom: "/java",
        imgsrc: java,
        title: "Java",
        p: "Java — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems. Разработка ведётся сообществом, организованным через Java Community Process; язык и основные реализующие его технологии распространяются по лицензии GPL."
    },
    {
        bottom: "/npm",
        imgsrc: npm,
        title: "npm пакеты",
        p: "npm — менеджер пакетов, входящий в состав Node.js. Установка пакета производится при помощи команды: npm install 'packagename' Все доступные для установки пакеты и их краткое описание: npm search Этой же командой можно производить выборочный поиск пакетов."
    },
    {
        bottom: "/diz",
        imgsrc: ui_ux,
        title: "UI UX",
        p: "UX/UI дизайн — это проектирование любых пользовательских интерфейсов в которых удобство использования так же важно как и внешний вид"
    },
    {
        bottom: "/sql",
        imgsrc: sql,
        title: "SQL",
        p: "SQL — декларативный язык программирования, применяемый для создания, модификации и управления данными в реляционной базе данных, управляемой соответствующей системой управления базами данных."
    },

]

export default Sdata;